experiments/2026-08-18-qwen-qwen3-8b-v1-5fa1f7e/vllm__fixed.log
INFO 08-18 17:04:16 [importing.py:53] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-18 17:04:16 [importing.py:88] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 08-18 17:04:18 [main.py:71] Unspecified platform detected, switching to CPU Platform instead.
WARNING 08-18 17:04:18 [cpu.py:440] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7d40e5ea8860>, trust_remote_code=False, seed=0, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://vllm:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='vllm__fixed.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-90d960ea-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-18 17:04:21 [utils.py:90] Sampling input_len from [512, 512] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Benchmark duration (s):                  42.32     
Total input tokens:                      102400    
Total generated tokens:                  25600     
Request throughput (req/s):              4.73      
Output token throughput (tok/s):         604.92    
Peak output token throughput (tok/s):    719.00    
Peak concurrent requests:                200.00    
Total token throughput (tok/s):          3024.58   
---------------Time to First Token----------------
Mean TTFT (ms):                          20364.10  
Median TTFT (ms):                        20355.37  
P99 TTFT (ms):                           40884.57  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          12.27     
Median TPOT (ms):                        12.46     
P99 TPOT (ms):                           12.99     
---------------Inter-token Latency----------------
Mean ITL (ms):                           12.27     
Median ITL (ms):                         11.23     
P99 ITL (ms):                            28.31     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          21921.76  
Median E2EL (ms):                        21939.18  
P99 E2EL (ms):                           42300.82  
==================================================

--- stderr ---
W0818 17:04:16.823000 1 torch/utils/cpp_extension.py:178] No CUDA runtime is found, using CUDA_HOME='/usr/local/cuda'
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/200 [00:00<?, ?it/s]
  0%|          | 1/200 [00:01<05:03,  1.52s/it]
  1%|          | 2/200 [00:01<02:19,  1.42it/s]
  4%|▎         | 7/200 [00:01<00:29,  6.50it/s]
  5%|▌         | 10/200 [00:03<00:54,  3.48it/s]
  6%|▌         | 12/200 [00:03<00:41,  4.49it/s]
  8%|▊         | 17/200 [00:04<00:46,  3.93it/s]
 10%|▉         | 19/200 [00:05<00:41,  4.40it/s]
 12%|█▎        | 25/200 [00:06<00:40,  4.29it/s]
 13%|█▎        | 26/200 [00:06<00:39,  4.45it/s]
 14%|█▎        | 27/200 [00:06<00:36,  4.76it/s]
 16%|█▋        | 33/200 [00:08<00:37,  4.50it/s]
 17%|█▋        | 34/200 [00:08<00:35,  4.66it/s]
 18%|█▊        | 35/200 [00:08<00:33,  4.99it/s]
 20%|██        | 41/200 [00:09<00:35,  4.52it/s]
 21%|██        | 42/200 [00:09<00:33,  4.68it/s]
 22%|██▏       | 43/200 [00:10<00:31,  5.02it/s]
 24%|██▍       | 49/200 [00:11<00:32,  4.59it/s]
 25%|██▌       | 50/200 [00:11<00:31,  4.74it/s]
 26%|██▌       | 51/200 [00:11<00:29,  5.09it/s]
 28%|██▊       | 57/200 [00:13<00:31,  4.55it/s]
 29%|██▉       | 58/200 [00:13<00:30,  4.71it/s]
 30%|██▉       | 59/200 [00:13<00:27,  5.05it/s]
 32%|███▎      | 65/200 [00:14<00:29,  4.54it/s]
 33%|███▎      | 66/200 [00:15<00:28,  4.70it/s]
 34%|███▎      | 67/200 [00:15<00:26,  5.04it/s]
 36%|███▋      | 73/200 [00:16<00:28,  4.53it/s]
 37%|███▋      | 74/200 [00:16<00:26,  4.69it/s]
 38%|███▊      | 75/200 [00:16<00:24,  5.03it/s]
 40%|████      | 81/200 [00:18<00:26,  4.53it/s]
 41%|████      | 82/200 [00:18<00:25,  4.69it/s]
 42%|████▏     | 83/200 [00:18<00:23,  5.03it/s]
 44%|████▍     | 89/200 [00:19<00:24,  4.53it/s]
 45%|████▌     | 90/200 [00:20<00:23,  4.69it/s]
 46%|████▌     | 91/200 [00:20<00:21,  5.03it/s]
 48%|████▊     | 97/200 [00:21<00:22,  4.53it/s]
 49%|████▉     | 98/200 [00:21<00:21,  4.69it/s]
 50%|████▉     | 99/200 [00:21<00:20,  5.03it/s]
 52%|█████▎    | 105/200 [00:23<00:20,  4.52it/s]
 53%|█████▎    | 106/200 [00:23<00:20,  4.69it/s]
 54%|█████▎    | 107/200 [00:23<00:18,  5.03it/s]
 56%|█████▋    | 113/200 [00:25<00:19,  4.53it/s]
 57%|█████▋    | 114/200 [00:25<00:18,  4.69it/s]
 57%|█████▊    | 115/200 [00:25<00:16,  5.03it/s]
 60%|██████    | 121/200 [00:26<00:17,  4.52it/s]
 61%|██████    | 122/200 [00:26<00:16,  4.69it/s]
 62%|██████▏   | 123/200 [00:27<00:15,  5.03it/s]
 64%|██████▍   | 129/200 [00:28<00:15,  4.53it/s]
 65%|██████▌   | 130/200 [00:28<00:14,  4.69it/s]
 66%|██████▌   | 131/200 [00:28<00:13,  5.03it/s]
 68%|██████▊   | 137/200 [00:30<00:13,  4.52it/s]
 69%|██████▉   | 138/200 [00:30<00:13,  4.69it/s]
 70%|██████▉   | 139/200 [00:30<00:12,  5.03it/s]
 72%|███████▎  | 145/200 [00:31<00:12,  4.51it/s]
 73%|███████▎  | 146/200 [00:32<00:11,  4.69it/s]
 74%|███████▎  | 147/200 [00:32<00:10,  5.03it/s]
 76%|███████▋  | 153/200 [00:33<00:10,  4.52it/s]
 77%|███████▋  | 154/200 [00:33<00:09,  4.69it/s]
 78%|███████▊  | 155/200 [00:33<00:08,  5.03it/s]
 80%|████████  | 161/200 [00:35<00:08,  4.52it/s]
 81%|████████  | 162/200 [00:35<00:08,  4.68it/s]
 82%|████████▏ | 163/200 [00:35<00:07,  5.03it/s]
 84%|████████▍ | 169/200 [00:36<00:06,  4.52it/s]
 85%|████████▌ | 170/200 [00:37<00:06,  4.68it/s]
 86%|████████▌ | 171/200 [00:37<00:05,  5.03it/s]
 88%|████████▊ | 177/200 [00:38<00:05,  4.52it/s]
 89%|████████▉ | 178/200 [00:38<00:04,  4.68it/s]
 90%|████████▉ | 179/200 [00:38<00:04,  5.03it/s]
 92%|█████████▎| 185/200 [00:40<00:03,  4.52it/s]
 93%|█████████▎| 186/200 [00:40<00:02,  4.68it/s]
 94%|█████████▎| 187/200 [00:40<00:02,  5.02it/s]
 96%|█████████▋| 193/200 [00:42<00:01,  4.52it/s]
 97%|█████████▋| 194/200 [00:42<00:01,  4.76it/s]
100%|██████████| 200/200 [00:42<00:00,  4.73it/s]